package objects;

public enum ListWork {
    EDU01("1977-1982", "Ставропольский политехнический институт", "Инженерно-экономический", "Инженер-экономист (Экономика и организация промышленности продовольственных товаров)"),
    WRK01("08.1982–11.1982", "Минераловодский винный завод", "Экономист (временно)", "Экономист НОТ"),
    WRK02("11.1982–06.1984", "Служба в рядах Советской Армии", "Военно-строительные войска", "Рядовой"),
    WRK03("08.1984–08.1984", "Минераловодский мясокомбинат", "Экономист", "Экономист НОТ"),
    WRK04("09.1984–05.1985", "Минераловодское отделение объединения «Ставропольснабсбыт»", "Экономист", "Ведение оперативного учета отгрузки металлопродукции"),
    WRK05("05.1985–11.1990", "Минераловодское предприятие оптовой торговли металлопродукцией «Ставропольснабсбыт»", "Старший экономист", "Ведение оперативного учета отгрузки металлопродукции с последующей автоматизацией на базе ПЭВМ Robotron  СМ-1910 и программных средств семейства dBase: интерпретаторы FoxBase+, FoxPro, создание полноценных программ на языке программирования CA-Clipper Summer 87."),
    WRK06("11.1990–01.1993", "Минераловодское предприятие оптовой торговли металлопродукцией «Ставропольснабсбыт»", "Начальник отдела АСУ", "Создание комплекса программ оперативного, складского и бухгалтерского учета средствами языка программирования CA-Clipper 5.2 на базе ПЭВМ Robotron  СМ-1910, PC/AT-386. Опыт руководства командой из 4 человек."),
    WRK07("01.1993–02.2008", "ЗАО «Минераловодское предприятие оптовой торговли ‘КПК Ставропольснаб’»", "Инженер-программист I категории", "Создание программно-аппаратного комплекса с объединением в Локальную Вычислительную Сеть предприятия средствами языка программирования CA-Clipper 5.3 на базе ПЭВМ PC/AT-386, PC/AT-486. Развитие программного комплекса на платформе 1С:Торговля и склад 7.7, 1С:Бухгалтерия 7.7\n" +
            "Знание: ОС: Windows 2000 / 2003 / XP (Server & Workstation). Серверные приложения: MS SQL, MS Terminal Server, 1C:Предприятие."),
    WRK08("02.2008–02.2009", "Филиал НБ «ТРАСТ» (ОАО) в г. Пятигорск", "Администратор отдела ИТ операционного офиса в г. Минеральные Воды", "Администрирование системы автоматизированного документооборота Lotus Notes. Подготовка проекта и внедрение телефонной станции Nortel Norstar BCM50. Поддержка телефонной станции, в том числе с использованием VoIP. Организация и поддержка удаленного доступа к серверам Головного Офиса на основе Citrix PS4 и Microsoft TS с использованием VPN и IPSec соединений.\n" +
            "Поддержка работы и обслуживание банкоматов Diebold Opteva 760, NCR. Настройка, установка и обслуживание POS-терминалов клиентам банка (Ethernet, DSL, WiFi). Администрирование компьютерной, печатающей и копировальной техники  (более 50 единиц). Диагностические и профилактические работы по поддержанию компьютерной техники и коммуникационного оборудования."),
    WRK09("02.2009–18.08.2016", "ООО КБ «ГРиС-Банк» г. Пятигорск", "Системный администратор отдела ИТ", "Администрирование серверов уровня Головного Офиса (Linux SuSE – 2 сервера, Win2003ЕЕ, Win2008ЕЕ – 2 сервера, Win2003SE – 4 сервера), диагностические и профилактические работы по поддержанию компьютерной техники и коммуникационного оборудования (более 50 ПК). Планирование, закупка и сборка серверов под задачи. Опыт прокладки телефонных, компьютерных и силовых сетей «с нуля». Поддержка телефонной станции Panasonic  KX-TDE100, в том числе с использованием VoIP через голосовые шлюзы D-Link.\n" +
            "Администрирование серверов баз данных Oracle : АБС «Банк – XXI век» («Инверсия») (установка, настройка и обслуживание БД; установка обновлений АБС), Банк-Клиент «iBank2» («БИФИТ») (установка, настройка и обслуживание БД, Сервера приложений, шлюзов АБС; установка обновлений Сервера приложений, шлюзов АБС). Обеспечение стабильной работы Internet-серверов основного и резервного провайдеров (Linux SuSE, IPFW, Samba, Squid). Организация удаленного доступа к серверам Головного Офиса на основе Kerio VPN Server (филиал «Московский») и роутеров MikroTIK с использованием PPTP VPN (доп. офисы банка в г. Пятигорске).\n" +
            "Организация и администрирование домена и почтового сервера на хостинге (RU-CENTER), создание и техническое сопровождение сайта (HTML) с последующим переводом  на CMS 1С-Битрикс (PHP). Подготовка и организация подключения к ГИС ГМП (Государственная информационная система о государственных и муниципальных платежах) в рамкахпортала СМЭВ (система межведомственного электронного взаимодействия) на основе ViPNet Coordinator HW1000, установка и администрирование EGC (адаптер «Egovernment Connector») на PostgreSQL. \n" +
            "Профессиональные навыки: Знание: ОС: Windows 2003 / 2008 / XP / 7 (Server & Workstation), Linux. Язык PL/SQL на уровне создания выборок и отчетов, пакетов  процедур и функций (АБС и Банк-Клиент), система аудита (Банк-Клиент). "),
    DOP01("Английский язык. Подготовка и организация подключения к ЕГАИС (Единая Государственная Автоматизированная Информационная Система) в рамках контроля государством объема производимого этилового спирта и оборота алкогольной и спиртосодержащей продукции.\n" +
          "Курс повышения квалификации «Информационная безопасность в компьютерных сетях» (76 часов) в Московский государственный институт электроники и математики (технический университет), 2010 год.\n" +
          "Умение работать как индивидуально, так и в команде; систематическое повышение профессионального уровня путем самообразования. ", "Изучение Интернет-технологий: «Web, HTML, CSS, PHP, JavaScript, AJAX, и др.», «Работа с HTML, CSS3, Java, JQuery».", "Постоянная регистрация г. Москва ", "e-mail: boris.mogilchenko@yandex.ru,\n" +
            "телефон: +7 (918) 797-05-60"),;


    private final String period;
    private final String name;
    private final String job;
    private final String functions;

    ListWork(String period, String name, String job, String functions) {
        this.period = period;
        this.name = name;
        this.job = job;
        this.functions = functions;
    }

    public String getPeriod() {
        return this.period;
    }

    public String getName() {
        return this.name;
    }

    public String getJob() {
        return this.job;
    }

    public String getFunctions() {
        return this.functions;
    }

}
